mxyxbb/LVGL_STM32F411_HAL_HandheldWeatherStation/Core/Src/lsm6dsm_STdC/driver/lsm6dsm_reg.h
#define LSM6DSM_SENSORHUB3_REG               0x30U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub3_reg_t;

#define LSM6DSM_SENSORHUB4_REG               0x31U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub4_reg_t;

#define LSM6DSM_SENSORHUB5_REG               0x32U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub5_reg_t;

#define LSM6DSM_SENSORHUB6_REG               0x33U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub6_reg_t;

#define LSM6DSM_SENSORHUB7_REG               0x34U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub7_reg_t;

#define LSM6DSM_SENSORHUB8_REG               0x35U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub8_reg_t;

#define LSM6DSM_SENSORHUB9_REG               0x36U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub9_reg_t;

#define LSM6DSM_SENSORHUB10_REG              0x37U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub10_reg_t;

#define LSM6DSM_SENSORHUB11_REG              0x38U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub11_reg_t;

#define LSM6DSM_SENSORHUB12_REG              0x39U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                     : 1;
  uint8_t bit6                     : 1;
  uint8_t bit5                     : 1;
  uint8_t bit4                     : 1;
  uint8_t bit3                     : 1;
  uint8_t bit2                     : 1;
  uint8_t bit1                     : 1;
  uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsm_sensorhub12_reg_t;

#define LSM6DSM_FIFO_STATUS1                 0x3AU
typedef struct {
  uint8_t diff_fifo                : 8;  /* + FIFO_STATUS2(diff_fifo) */
} lsm6dsm_fifo_status1_t;

