mxyxbb/LVGL_STM32F411_HAL_HandheldWeatherStation/Core/Src/lsm6dsm_STdC/driver/lsm6dsm_reg.h
typedef enum {
  LSM6DSM_LP2_ONLY                    = 0x00,

  LSM6DSM_HP_16mHz_LP2                = 0x80,
  LSM6DSM_HP_65mHz_LP2                = 0x90,
  LSM6DSM_HP_260mHz_LP2               = 0xA0,
  LSM6DSM_HP_1Hz04_LP2                = 0xB0,

  LSM6DSM_HP_DISABLE_LP1_LIGHT        = 0x0A,
  LSM6DSM_HP_DISABLE_LP1_NORMAL       = 0x09,
  LSM6DSM_HP_DISABLE_LP_STRONG        = 0x08,
  LSM6DSM_HP_DISABLE_LP1_AGGRESSIVE   = 0x0B,

  LSM6DSM_HP_16mHz_LP1_LIGHT          = 0x8A,
  LSM6DSM_HP_65mHz_LP1_NORMAL         = 0x99,
  LSM6DSM_HP_260mHz_LP1_STRONG        = 0xA8,
  LSM6DSM_HP_1Hz04_LP1_AGGRESSIVE     = 0xBB,
} lsm6dsm_lpf1_sel_g_t;
int32_t lsm6dsm_gy_band_pass_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_lpf1_sel_g_t val);
int32_t lsm6dsm_gy_band_pass_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_lpf1_sel_g_t *val);

int32_t lsm6dsm_gy_ui_high_pass_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_gy_ui_high_pass_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_HP_DISABLE_LP_173Hz        = 0x02,
  LSM6DSM_HP_DISABLE_LP_237Hz        = 0x01,
  LSM6DSM_HP_DISABLE_LP_351Hz        = 0x00,
  LSM6DSM_HP_DISABLE_LP_937Hz        = 0x03,

  LSM6DSM_HP_16mHz_LP_173Hz          = 0x82,
  LSM6DSM_HP_65mHz_LP_237Hz          = 0x91,
  LSM6DSM_HP_260mHz_LP_351Hz         = 0xA0,
  LSM6DSM_HP_1Hz04_LP_937Hz          = 0xB3,
} lsm6dsm_hp_en_ois_t;
int32_t lsm6dsm_gy_aux_bandwidth_set(stmdev_ctx_t *ctx,
                                     lsm6dsm_hp_en_ois_t val);
int32_t lsm6dsm_gy_aux_bandwidth_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_hp_en_ois_t *val);

int32_t lsm6dsm_aux_status_reg_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_status_spiaux_t *val);

int32_t lsm6dsm_aux_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsm_aux_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsm_aux_gy_flag_settling_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

typedef enum {
  LSM6DSM_AUX_DEN_DISABLE         = 0,
  LSM6DSM_AUX_DEN_LEVEL_LATCH     = 3,
  LSM6DSM_AUX_DEN_LEVEL_TRIG      = 2,
} lsm6dsm_lvl_ois_t;
int32_t lsm6dsm_aux_den_mode_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_lvl_ois_t val);
int32_t lsm6dsm_aux_den_mode_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_lvl_ois_t *val);

int32_t lsm6dsm_aux_drdy_on_int2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_aux_drdy_on_int2_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_AUX_DISABLE   = 0,
  LSM6DSM_MODE_3_GY     = 1,
  LSM6DSM_MODE_4_GY_XL  = 3,
} lsm6dsm_ois_en_spi2_t;
int32_t lsm6dsm_aux_mode_set(stmdev_ctx_t *ctx,
                             lsm6dsm_ois_en_spi2_t val);
int32_t lsm6dsm_aux_mode_get(stmdev_ctx_t *ctx,
                             lsm6dsm_ois_en_spi2_t *val);

typedef enum {
  LSM6DSM_250dps_AUX   = 0,
  LSM6DSM_125dps_AUX   = 1,
  LSM6DSM_500dps_AUX   = 2,
  LSM6DSM_1000dps_AUX  = 4,
  LSM6DSM_2000dps_AUX  = 6,
} lsm6dsm_fs_g_ois_t;
int32_t lsm6dsm_aux_gy_full_scale_set(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_g_ois_t val);
int32_t lsm6dsm_aux_gy_full_scale_get(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_g_ois_t *val);

typedef enum {
  LSM6DSM_AUX_SPI_4_WIRE = 0,
  LSM6DSM_AUX_SPI_3_WIRE = 1,
} lsm6dsm_sim_ois_t;
int32_t lsm6dsm_aux_spi_mode_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_sim_ois_t val);
int32_t lsm6dsm_aux_spi_mode_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_sim_ois_t *val);

typedef enum {
  LSM6DSM_AUX_LSB_AT_LOW_ADD = 0,
  LSM6DSM_AUX_MSB_AT_LOW_ADD = 1,
} lsm6dsm_ble_ois_t;
int32_t lsm6dsm_aux_data_format_set(stmdev_ctx_t *ctx,
                                    lsm6dsm_ble_ois_t val);
int32_t lsm6dsm_aux_data_format_get(stmdev_ctx_t *ctx,
                                    lsm6dsm_ble_ois_t *val);

typedef enum {
  LSM6DSM_ENABLE_CLAMP    = 0,
  LSM6DSM_DISABLE_CLAMP   = 1,
} lsm6dsm_st_ois_clampdis_t;
int32_t lsm6dsm_aux_gy_clamp_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_st_ois_clampdis_t val);
int32_t lsm6dsm_aux_gy_clamp_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_st_ois_clampdis_t *val);

typedef enum {
  LSM6DSM_AUX_GY_DISABLE  = 0,
  LSM6DSM_AUX_GY_POS      = 1,
  LSM6DSM_AUX_GY_NEG      = 3,
} lsm6dsm_st_ois_t;
int32_t lsm6dsm_aux_gy_self_test_set(stmdev_ctx_t *ctx,
                                     lsm6dsm_st_ois_t val);
int32_t lsm6dsm_aux_gy_self_test_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_st_ois_t *val);

typedef enum {
  LSM6DSM_AUX_2g   = 0,
  LSM6DSM_AUX_16g  = 1,
  LSM6DSM_AUX_4g   = 2,
  LSM6DSM_AUX_8g   = 3,
} lsm6dsm_fs_xl_ois_t;
int32_t lsm6dsm_aux_xl_full_scale_set(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_xl_ois_t val);
int32_t lsm6dsm_aux_xl_full_scale_get(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_xl_ois_t *val);

typedef enum {
  LSM6DSM_AUX_DEN_ACTIVE_LOW   = 0,
  LSM6DSM_AUX_DEN_ACTIVE_HIGH  = 1,
} lsm6dsm_den_lh_ois_t;
int32_t lsm6dsm_aux_den_polarity_set(stmdev_ctx_t *ctx,
                                     lsm6dsm_den_lh_ois_t val);
int32_t lsm6dsm_aux_den_polarity_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_den_lh_ois_t *val);

typedef enum {
  LSM6DSM_SPI_4_WIRE  = 0,
  LSM6DSM_SPI_3_WIRE  = 1,
} lsm6dsm_sim_t;
int32_t lsm6dsm_spi_mode_set(stmdev_ctx_t *ctx, lsm6dsm_sim_t val);
int32_t lsm6dsm_spi_mode_get(stmdev_ctx_t *ctx, lsm6dsm_sim_t *val);

typedef enum {
  LSM6DSM_I2C_ENABLE   = 0,
  LSM6DSM_I2C_DISABLE  = 1,
} lsm6dsm_i2c_disable_t;
int32_t lsm6dsm_i2c_interface_set(stmdev_ctx_t *ctx,
                                  lsm6dsm_i2c_disable_t val);
int32_t lsm6dsm_i2c_interface_get(stmdev_ctx_t *ctx,
                                  lsm6dsm_i2c_disable_t *val);

