mxyxbb/LVGL_STM32F411_HAL_HandheldWeatherStation/Core/Src/lsm6dsm_STdC/driver/lsm6dsm_reg.h
typedef struct {
  uint8_t int1_drdy_xl             : 1;
  uint8_t int1_drdy_g              : 1;
  uint8_t int1_boot                : 1;
  uint8_t int1_fth                 : 1;
  uint8_t int1_fifo_ovr            : 1;
  uint8_t int1_full_flag           : 1;
  uint8_t int1_sign_mot            : 1;
  uint8_t int1_step_detector       : 1;
  uint8_t int1_timer               : 1;
  uint8_t int1_tilt                : 1;
  uint8_t int1_6d                  : 1;
  uint8_t int1_double_tap          : 1;
  uint8_t int1_ff                  : 1;
  uint8_t int1_wu                  : 1;
  uint8_t int1_single_tap          : 1;
  uint8_t int1_inact_state         : 1;
  uint8_t den_drdy_int1            : 1;
  uint8_t drdy_on_int1             : 1;
} lsm6dsm_int1_route_t;
int32_t lsm6dsm_pin_int1_route_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_int1_route_t val);
int32_t lsm6dsm_pin_int1_route_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_int1_route_t *val);

typedef struct {
  uint8_t int2_drdy_xl             : 1;
  uint8_t int2_drdy_g              : 1;
  uint8_t int2_drdy_temp           : 1;
  uint8_t int2_fth                 : 1;
  uint8_t int2_fifo_ovr            : 1;
  uint8_t int2_full_flag           : 1;
  uint8_t int2_step_count_ov       : 1;
  uint8_t int2_step_delta          : 1;
  uint8_t int2_iron                : 1;
  uint8_t int2_tilt                : 1;
  uint8_t int2_6d                  : 1;
  uint8_t int2_double_tap          : 1;
  uint8_t int2_ff                  : 1;
  uint8_t int2_wu                  : 1;
  uint8_t int2_single_tap          : 1;
  uint8_t int2_inact_state         : 1;
  uint8_t int2_wrist_tilt          : 1;
} lsm6dsm_int2_route_t;
int32_t lsm6dsm_pin_int2_route_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_int2_route_t val);
int32_t lsm6dsm_pin_int2_route_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_int2_route_t *val);

typedef enum {
  LSM6DSM_PUSH_PULL   = 0,
  LSM6DSM_OPEN_DRAIN  = 1,
} lsm6dsm_pp_od_t;
int32_t lsm6dsm_pin_mode_set(stmdev_ctx_t *ctx, lsm6dsm_pp_od_t val);
int32_t lsm6dsm_pin_mode_get(stmdev_ctx_t *ctx, lsm6dsm_pp_od_t *val);

typedef enum {
  LSM6DSM_ACTIVE_HIGH   = 0,
  LSM6DSM_ACTIVE_LOW    = 1,
} lsm6dsm_h_lactive_t;
int32_t lsm6dsm_pin_polarity_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_h_lactive_t val);
int32_t lsm6dsm_pin_polarity_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_h_lactive_t *val);

int32_t lsm6dsm_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_INT_PULSED   = 0,
  LSM6DSM_INT_LATCHED  = 1,
} lsm6dsm_lir_t;
int32_t lsm6dsm_int_notification_set(stmdev_ctx_t *ctx,
                                     lsm6dsm_lir_t val);
int32_t lsm6dsm_int_notification_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_lir_t *val);

int32_t lsm6dsm_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_gy_sleep_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_gy_sleep_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_PROPERTY_DISABLE          = 0,
  LSM6DSM_XL_12Hz5_GY_NOT_AFFECTED  = 1,
  LSM6DSM_XL_12Hz5_GY_SLEEP         = 2,
  LSM6DSM_XL_12Hz5_GY_PD            = 3,
} lsm6dsm_inact_en_t;
int32_t lsm6dsm_act_mode_set(stmdev_ctx_t *ctx,
                             lsm6dsm_inact_en_t val);
int32_t lsm6dsm_act_mode_get(stmdev_ctx_t *ctx,
                             lsm6dsm_inact_en_t *val);

int32_t lsm6dsm_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_src_get(stmdev_ctx_t *ctx,
                            lsm6dsm_tap_src_t *val);

int32_t lsm6dsm_tap_detection_on_z_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsm_tap_detection_on_z_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsm_tap_detection_on_y_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsm_tap_detection_on_y_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsm_tap_detection_on_x_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsm_tap_detection_on_x_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsm_tap_threshold_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_threshold_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_shock_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_shock_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_quiet_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_quiet_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_ONLY_SINGLE          = 0,
  LSM6DSM_BOTH_SINGLE_DOUBLE   = 1,
} lsm6dsm_single_double_tap_t;
int32_t lsm6dsm_tap_mode_set(stmdev_ctx_t *ctx,
                             lsm6dsm_single_double_tap_t val);
int32_t lsm6dsm_tap_mode_get(stmdev_ctx_t *ctx,
                             lsm6dsm_single_double_tap_t *val);

typedef enum {
  LSM6DSM_ODR_DIV_2_FEED      = 0,
  LSM6DSM_LPF2_FEED           = 1,
} lsm6dsm_low_pass_on_6d_t;
int32_t lsm6dsm_6d_feed_data_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_low_pass_on_6d_t val);
int32_t lsm6dsm_6d_feed_data_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_low_pass_on_6d_t *val);

typedef enum {
  LSM6DSM_DEG_80      = 0,
  LSM6DSM_DEG_70      = 1,
  LSM6DSM_DEG_60      = 2,
  LSM6DSM_DEG_50      = 3,
} lsm6dsm_sixd_ths_t;
int32_t lsm6dsm_6d_threshold_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_sixd_ths_t val);
int32_t lsm6dsm_6d_threshold_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_sixd_ths_t *val);

int32_t lsm6dsm_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_ff_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_ff_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

