mxyxbb/LVGL_STM32F411_HAL_HandheldWeatherStation/Core/Src/lsm6dsm_STdC/driver/lsm6dsm_reg.h
typedef enum {
  LSM6DSM_STAMP_IN_GY_DATA     = 0,
  LSM6DSM_STAMP_IN_XL_DATA     = 1,
  LSM6DSM_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dsm_den_xl_en_t;
int32_t lsm6dsm_den_enable_set(stmdev_ctx_t *ctx,
                               lsm6dsm_den_xl_en_t val);
int32_t lsm6dsm_den_enable_get(stmdev_ctx_t *ctx,
                               lsm6dsm_den_xl_en_t *val);

int32_t lsm6dsm_den_mark_axis_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_den_mark_axis_z_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_den_mark_axis_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_den_mark_axis_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_den_mark_axis_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_den_mark_axis_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_step_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_step_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_PEDO_AT_2g = 0,
  LSM6DSM_PEDO_AT_4g = 1,
} lsm6dsm_pedo_fs_t;
int32_t lsm6dsm_pedo_full_scale_set(stmdev_ctx_t *ctx,
                                    lsm6dsm_pedo_fs_t val);
int32_t lsm6dsm_pedo_full_scale_get(stmdev_ctx_t *ctx,
                                    lsm6dsm_pedo_fs_t *val);

int32_t lsm6dsm_pedo_debounce_steps_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6dsm_pedo_debounce_steps_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6dsm_pedo_timeout_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_timeout_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_steps_period_set(stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6dsm_pedo_steps_period_get(stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lsm6dsm_motion_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_motion_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_motion_threshold_set(stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t lsm6dsm_motion_threshold_get(stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t lsm6dsm_tilt_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tilt_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_wrist_tilt_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_wrist_tilt_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tilt_latency_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_tilt_latency_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_tilt_threshold_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_tilt_threshold_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_tilt_src_set(stmdev_ctx_t *ctx,
                             lsm6dsm_a_wrist_tilt_mask_t *val);
int32_t lsm6dsm_tilt_src_get(stmdev_ctx_t *ctx,
                             lsm6dsm_a_wrist_tilt_mask_t *val);

int32_t lsm6dsm_mag_soft_iron_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_mag_soft_iron_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_mag_hard_iron_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_mag_hard_iron_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_mag_soft_iron_mat_set(stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6dsm_mag_soft_iron_mat_get(stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lsm6dsm_mag_offset_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dsm_mag_offset_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsm_func_en_set(stmdev_ctx_t *ctx, uint8_t val);

int32_t lsm6dsm_sh_sync_sens_frame_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsm_sh_sync_sens_frame_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum {
  LSM6DSM_RES_RATIO_2_11  = 0,
  LSM6DSM_RES_RATIO_2_12  = 1,
  LSM6DSM_RES_RATIO_2_13  = 2,
  LSM6DSM_RES_RATIO_2_14  = 3,
} lsm6dsm_rr_t;
int32_t lsm6dsm_sh_sync_sens_ratio_set(stmdev_ctx_t *ctx,
                                       lsm6dsm_rr_t val);
int32_t lsm6dsm_sh_sync_sens_ratio_get(stmdev_ctx_t *ctx,
                                       lsm6dsm_rr_t *val);

int32_t lsm6dsm_sh_master_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_master_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_sh_pass_through_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_pass_through_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_EXT_PULL_UP       = 0,
  LSM6DSM_INTERNAL_PULL_UP  = 1,
  LSM6DSM_SH_PIN_MODE       = 2,
} lsm6dsm_pull_up_en_t;
int32_t lsm6dsm_sh_pin_mode_set(stmdev_ctx_t *ctx,
                                lsm6dsm_pull_up_en_t val);
int32_t lsm6dsm_sh_pin_mode_get(stmdev_ctx_t *ctx,
                                lsm6dsm_pull_up_en_t *val);

typedef enum {
  LSM6DSM_XL_GY_DRDY        = 0,
  LSM6DSM_EXT_ON_INT2_PIN   = 1,
} lsm6dsm_start_config_t;
int32_t lsm6dsm_sh_syncro_mode_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_start_config_t val);
int32_t lsm6dsm_sh_syncro_mode_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_start_config_t *val);

int32_t lsm6dsm_sh_drdy_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_drdy_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  lsm6dsm_sensorhub1_reg_t   sh_byte_1;
  lsm6dsm_sensorhub2_reg_t   sh_byte_2;
  lsm6dsm_sensorhub3_reg_t   sh_byte_3;
  lsm6dsm_sensorhub4_reg_t   sh_byte_4;
  lsm6dsm_sensorhub5_reg_t   sh_byte_5;
  lsm6dsm_sensorhub6_reg_t   sh_byte_6;
  lsm6dsm_sensorhub7_reg_t   sh_byte_7;
  lsm6dsm_sensorhub8_reg_t   sh_byte_8;
  lsm6dsm_sensorhub9_reg_t   sh_byte_9;
  lsm6dsm_sensorhub10_reg_t  sh_byte_10;
  lsm6dsm_sensorhub11_reg_t  sh_byte_11;
  lsm6dsm_sensorhub12_reg_t  sh_byte_12;
  lsm6dsm_sensorhub13_reg_t  sh_byte_13;
  lsm6dsm_sensorhub14_reg_t  sh_byte_14;
  lsm6dsm_sensorhub15_reg_t  sh_byte_15;
  lsm6dsm_sensorhub16_reg_t  sh_byte_16;
  lsm6dsm_sensorhub17_reg_t  sh_byte_17;
  lsm6dsm_sensorhub18_reg_t  sh_byte_18;
} lsm6dsm_emb_sh_read_t;
int32_t lsm6dsm_sh_read_data_raw_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_emb_sh_read_t *val);

int32_t lsm6dsm_sh_cmd_sens_sync_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_cmd_sens_sync_get(stmdev_ctx_t *ctx, uint8_t *val);

