mxyxbb/LVGL_STM32F411_HAL_HandheldWeatherStation/Core/Src/lsm6dsm_STdC/driver/lsm6dsm_reg.h
int32_t lsm6dsm_sh_spi_sync_error_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_spi_sync_error_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum {
  LSM6DSM_NORMAL_MODE_READ  = 0,
  LSM6DSM_SRC_MODE_READ     = 1,
} lsm6dsm_src_mode_t;
int32_t lsm6dsm_sh_cfg_slave_0_rd_mode_set(stmdev_ctx_t *ctx,
                                           lsm6dsm_src_mode_t val);
int32_t lsm6dsm_sh_cfg_slave_0_rd_mode_get(stmdev_ctx_t *ctx,
                                           lsm6dsm_src_mode_t *val);

typedef enum {
  LSM6DSM_SLV_0        = 0,
  LSM6DSM_SLV_0_1      = 1,
  LSM6DSM_SLV_0_1_2    = 2,
  LSM6DSM_SLV_0_1_2_3  = 3,
} lsm6dsm_aux_sens_on_t;
int32_t lsm6dsm_sh_num_of_dev_connected_set(stmdev_ctx_t *ctx,
                                            lsm6dsm_aux_sens_on_t val);
int32_t lsm6dsm_sh_num_of_dev_connected_get(stmdev_ctx_t *ctx,
                                            lsm6dsm_aux_sens_on_t *val);

typedef struct {
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dsm_sh_cfg_write_t;
int32_t lsm6dsm_sh_cfg_write(stmdev_ctx_t *ctx,
                             lsm6dsm_sh_cfg_write_t *val);

typedef struct {
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dsm_sh_cfg_read_t;
int32_t lsm6dsm_sh_slv0_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);
int32_t lsm6dsm_sh_slv1_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);
int32_t lsm6dsm_sh_slv2_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);
int32_t lsm6dsm_sh_slv3_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);

typedef enum {
  LSM6DSM_SL0_NO_DEC   = 0,
  LSM6DSM_SL0_DEC_2    = 1,
  LSM6DSM_SL0_DEC_4    = 2,
  LSM6DSM_SL0_DEC_8    = 3,
} lsm6dsm_slave0_rate_t;
int32_t lsm6dsm_sh_slave_0_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave0_rate_t val);
int32_t lsm6dsm_sh_slave_0_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave0_rate_t *val);

typedef enum {
  LSM6DSM_EACH_SH_CYCLE     = 0,
  LSM6DSM_ONLY_FIRST_CYCLE  = 1,
} lsm6dsm_write_once_t;
int32_t lsm6dsm_sh_write_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dsm_write_once_t val);
int32_t lsm6dsm_sh_write_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dsm_write_once_t *val);

typedef enum {
  LSM6DSM_SL1_NO_DEC   = 0,
  LSM6DSM_SL1_DEC_2    = 1,
  LSM6DSM_SL1_DEC_4    = 2,
  LSM6DSM_SL1_DEC_8    = 3,
} lsm6dsm_slave1_rate_t;
int32_t lsm6dsm_sh_slave_1_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave1_rate_t val);
int32_t lsm6dsm_sh_slave_1_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave1_rate_t *val);

typedef enum {
  LSM6DSM_SL2_NO_DEC  = 0,
  LSM6DSM_SL2_DEC_2   = 1,
  LSM6DSM_SL2_DEC_4   = 2,
  LSM6DSM_SL2_DEC_8   = 3,
} lsm6dsm_slave2_rate_t;
int32_t lsm6dsm_sh_slave_2_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave2_rate_t val);
int32_t lsm6dsm_sh_slave_2_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave2_rate_t *val);

typedef enum {
  LSM6DSM_SL3_NO_DEC  = 0,
  LSM6DSM_SL3_DEC_2   = 1,
  LSM6DSM_SL3_DEC_4   = 2,
  LSM6DSM_SL3_DEC_8   = 3,
} lsm6dsm_slave3_rate_t;
int32_t lsm6dsm_sh_slave_3_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave3_rate_t val);
int32_t lsm6dsm_sh_slave_3_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave3_rate_t *val);

/**
  * @}
  *
  */
// Kalman structure
typedef struct {
    double Q_angle;
    double Q_bias;
    double R_measure;
    double angle;
    double bias;
    double P[2][2];
} Kalman_t;


void lsm6dsm_read_data_polling(void);  
void imu_lsm6dsm_read(void);

#ifdef __cplusplus
}
#endif

#endif /* LSM6DSM_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
